Tekla Open API Reference for Tekla Structures 2025
PointPlacing Constructor
 Creates a new point placing instance. The value used for the placing is the parent object's insertion point in this case.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PointPlacing()
Public Sub New
See Also
Reference
PointPlacing Class
Tekla.Structures.Drawing Namespace